stock_api/app/controllers/prices_controller.rb

SELECT "prices".* FROM "prices"
---
  def index
    @prices = Price.all

INSERT INTO "prices" ("price", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["price", 14], ["company_id", 1], ["created_at", "2019-08-11 23:47:27.136467"], ["updated_at", "2019-08-11 23:47:27.136467"]]
---
  def create
    @price = Price.new(price_params)

    if @price.save