stock_api/app/controllers/users_controller.rb

  def login
    user = User.find_by(user_name: params[:user][:user_name])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "Kyle"], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("user_name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"